Revit 2024 API
RailingType.SecondaryHandRailPosition Property
 The position of the secondary handrail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public HandRailPosition SecondaryHandRailPosition { get; set; }
Visual Basic
Public Property SecondaryHandRailPosition As HandRailPosition
	Get
	Set
Visual C++
public:
property HandRailPosition SecondaryHandRailPosition {
	HandRailPosition get ();
	void set (HandRailPosition value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: The rail has no secondary hand rail.
See Also
RailingType Class
Autodesk.Revit.DB.Architecture Namespace